
  const datalist = {
    // 卡片数据
    countData: [
      {
        "name": "今日订单总数",
        "value": 3256,
        "color": "#0984e3",
      },
      {
        "name": "今日销售总额",
        "value": 45987,
        "color": "#ff7675"
      },
      {
        "name": "昨日销售总额",
        "value": 12358,
        "color": "#fbc531"
      },
      {
        "name": "近七天销售总额",
        "value": 264589,
        "color": "#5ab1ef"
      },
    ],
    // 折线图数据
    linechart: {
      "date": [
        "20191001",
        "20191001",
        "20191001",
        "20191001",
        "20191001",
        "20191001",
        "20191001"
      ],
      "data": [
        {
          "男装": 5555,
          "女装": 2345,
          "化妆品": 5789,
          "童装": 4366,
          "母婴": 5642,
          "饰品": 1234
        },
        {
          "男装": 3564,
          "女装": 6776,
          "化妆品": 5543,
          "童装": 3344,
          "母婴": 2222,
          "饰品": 1111
        },
        {
          "男装": 5421,
          "女装": 2232,
          "化妆品": 1431,
          "童装": 1200,
          "母婴": 5100,
          "饰品": 4299
        },
        {
          "男装": 2453,
          "女装": 4111,
          "化妆品": 5642,
          "童装": 7421,
          "母婴": 6532,
          "饰品": 1000
        },
        {
          "男装": 2000,
          "女装": 3125,
          "化妆品": 2749,
          "oppo": 3667,
          "母婴": 7009,
          "饰品": 6543
        },
        {
          "男装": 2532,
          "女装": 4322,
          "化妆品": 4567,
          "oppo": 1998,
          "母婴": 1622,
          "饰品": 6432
        },
        {
          "男装": 2345,
          "女装": 5532,
          "化妆品": 1123,
          "童装": 3454,
          "母婴": 4521,
          "饰品": 3556
        }
      ]
    },
    userData: [
      {
        "date": "周一",
        "new": 5,
        "active": 200
      },
      {
        "date": "周二",
        "new": 10,
        "active": 500
      },
      {
        "date": "周三",
        "new": 12,
        "active": 550
      },
      {
        "date": "周四",
        "new": 60,
        "active": 800
      },
      {
        "date": "周五",
        "new": 65,
        "active": 550
      },
      {
        "date": "周六",
        "new": 53,
        "active": 770
      },
      {
        "date": "周日",
        "new": 33,
        "active": 170
      }
    ],
    cakeData: [
      {
        "name": "男装",
        "value": 2999
      },
      {
        "name": "女装",
        "value": 3106
      },
      {
        "name": "化妆品",
        "value": 1500
      },
      {
        "name": "童装",
        "value": 1999
      },
      {
        "name": "母婴",
        "value": 1999
      },
      {
        "name": "饰品",
        "value": 855
      },
      
    ],
    
  }

export default datalist